[{"Name":"Christopher Reali","Position":"Engineering Supervisor, Revenue Metering","Affiliation":"Independent Electricity System Operator","Logo":"assets/Megan and Chris - ieso-logo-lrg.png","Topic":"Introduction to the IESO and Ontario's Changing Energy Landscape","Profile":"Chris_Reali_Headshot.png","Abstract":"The Independent Electricity System Operator (IESO) works at the heart of Ontario's power system. The IESO delivers key services across the electricity sector including: managing the power system in real-time, planning for the province's future energy needs, enabling conservation and designing a more efficient electricity marketplace to support sector evolution.","Bio":"Christopher Reali is a Professional Engineer and the acting Engineering Supervisor, Revenue Metering at the Independent Electricity System Operator where he is responsible for the over 2000 high voltage Revenue Metering Installations and instrumentation used for the settlement of approximately $25 billion dollars per year in Ontario’s Wholesale Electricity Market. In his home position at the IESO as a Senior Planner in the Transmission Integration department, he has over 8 years of experience leading the development of power system plans across northern Ontario, recommending and implementing system investments of tens and up to hundreds of millions of dollars. He is a Canadian member for the Study Committee of System Development and Economics at the International Council on Large Electric Systems, where heis convening an international working group and co-authoring a text book on Asset Management. Christopher has a Master of Engineering degree in Electric Power Systems from the University of Waterloo and a Bachelor of Applied Science Degree in Chemical Engineering with an Energy Minor from the University of Toronto. He is a former U of T PEY student and is excited to back at his alma mater to speak to the future of the Energy Industry."},{"Name":"Megan Lund","Position":"Planner, Transmission Integration","Affiliation":"Independent Electricity System Operator","Logo":"assets/Megan and Chris - ieso-logo-lrg.png","Topic":"Development of a Transmission Line — The Planning Process and Beyond","Profile":"Megan lund from IESO.png","Abstract":"Transmission is the backbone of the electricity system and has grown and adapted to reliably serve customers for over a hundred years. This talk will give an overview of Ontario’s transmission system, explore why we build transmission lines, and walk through the steps of developing a large transmission project — from determining the need for the facility through to construction.","Bio":"Megan Lund is a Transmission Planner with the Independent Electricity System Operator (IESO), leading and developing integrated regional plans for multiple local areas throughout the province, including Barrie-Innisfil, the City of Hamilton, and Windsor-Essex. She is the planning lead for the development of the East-West Tie Transmission Line, a new 450 km double circuit 230 kV line reinforcing the existing connection from Wawa to Thunder Bay, Ontario. Megan is also a working group contributor to the Council on Large Electric Systems’ (CIGRE’s) ongoing work on the topic of Large City and Metropolitan Area Development Trends. \n\nPrior to joining the IESO, she was a distribution planner with Toronto Hydro, with expertise in planning underground distribution systems for dense urban environments and asset management, and served as an instructor in electrical theory at Toronto Hydro’s trades school. \n\nMegan has a Bachelor’s of Applied Science in Engineering Science, majoring in Energy Systems, from the University of Toronto"},{"Name":"Bhanu Opathella","Position":"IESO Distinguished Research Fellow","Affiliation":"Ryerson University","Logo":"https://www.ryerson.ca/etc/designs/ryecms/clientlib-site/images/ryerson_logo.svg","Topic":"Energy Storage and Its Benefits to Ontario","Profile":"b.png","Abstract":"We are in the era of renewable energy, the era of clean and inexpensive electricity. We are replacing fossil fuel generators with renewable generators. Can we entirely depend on intermittent renewable generators? Probably not, because electricity supply should have the ability to follow the changing electricity demand, which the intermittent generators often fail to provide. How can we improve dispatchability of the electricity supply system? Energy storage systems can help us store the clean electricity during off-peak hours and release during peak hours. They can improve the dispatchability and facilitate more renewable energy. It is the time to understand the storage technologies and their benefits to a province like Ontario.","Bio":"Dr. Bhanu Opathella is a Senior Research Fellow at the Centre for Urban Energy (CUE) at Ryerson University, Toronto. He has a PhD degree in Power System Optimization, a master's degree in Energy Economics and Planning, and a bachelor's degree in Electrical Engineering. He has authored or co-authored more than 30 research articles and industrial reports. \n\nDr. Opathella works on large energy storage research projects and microgrid projects at CUE. His projects have been funded by the IESO, Hydro One, Toronto Hydro, Ontario Centres of Excellence, PowerStream and Semiconductor Research Corporation.\n\nBefore coming to Canada, Dr. Opathella worked for four years in the Transmission and Generation Planning Branch of the Ceylon Electricity Board in Sri Lanka. He has also worked as a researcher at the Asian Institute of Technology in Thailand.\n\nDr. Opathella is a member of IEEE and a registered professional engineer in Ontario."},{"Name":"Neil Mitchells","Position":"Vice-President Engineering, Nuclear Refurbishment","Affiliation":"Ontario Power Generation","Logo":"assets/opgnew.png","Topic":"Ontario Power Generation Darlington Refurbishment","Profile":"Neil.jpg","Abstract":"","Bio":"<a href=\"assets/Neil.pdf\">More about the speaker</a>"},{"Name":"Xin Zheng","Position":"Power Grid Protection and Control Engineering Designer","Affiliation":"Hydro One, also Cofounder of Xtend Education","Logo":"","Topic":"Introduction to a Career in Power Systems","Profile":"xin.jpg"}]